import java.util.Arrays;

public class Main {
    public static void main(String[] args) {
        int value = 33;
        changeValue(value);
        System.out.println(value);
        Integer value2=33;
        changeValue(value2);
        System.out.println(value2);
        Integer[] array= new Integer[] {3,4};
        System.out.println(Arrays.toString(array));
        changeArrayValue(array);
        System.out.println(Arrays.toString(array));
        Person p= new Person("Lyapis", "Trubetskoy");
        p.changePerson(p);
        System.out.println(p);
        p.changePerson2(p);
        System.out.println(p);

    }
    private static void changeValue(int value) {

        value = 22;
    }
    private static void changeValue(Integer value) {

        value = 22;
    }
    private static void changeValue(Integer[] arr) {

        arr = new Integer[]{1, 2};
    }
    private static void changeArrayValue(Integer[] arr) {

        arr[0] = 99;
        System.out.println("Вопрос задачи 5;Значение будет 33, потому что при передаче переменной " +
                "в метод changeValue, копия значения переменной передается, и изменение копии в методе не влияет на начальное значение переменной value в методе main");
        System.out.println("Вопрос 6;Значение будет 33, потому, что объекты типа Integer неизменяемы, и изменение значения переменной value " +
                "в методе changeValue не влияет на начальный обьеки в методе main, к которому обращается переменная");
        System.out.println( "Анализ 5-6;В обоих задачах происходит передача копии значения переменной в метод changeValue, а не самой переменной, что означает, что изменение значения внутри метода не влияет на исходное значение переменной в методе main. Однако, в задаче 6, с объектами типа Integer, внутреннее изменение объекта" +
                " не отражается на исходном объекте, так как объекты типа Integer являются неизменяемыми ");
        System.out.println( "-------------------------------------------------------------------------------------");
        System.out.println("Вопрос 7; Значения будут {3, 4}, потому, что при передаче массива в метод changeValue, копия ссылки на массив передается в метод.Но изменения не влияют на исходный массив value в методе main");
        System.out.println("Вопрос 8; Значения массива будут {99, 4}, потому, что при передаче массива в метод changeValue, ссылка на этот массив передается. Внутри метода changeValue изменяется значение первого элемента массива, присваивая ему значение 99");
        System.out.println("Анализ 7-8;Задачи измененяют значения массива внутри метода. В задаче 7, изменение значения происходит с помощью присваивания нового значения ячейке массива, а в задаче 8, присваивание нового массива." +
                " В обоих случаях изменения в методе отражаются на исходном массиве в методе main. Отличие заключается в том, что в задаче 7 изменяется только одно значение ячейки, а в задаче 8 создается новый массив и ссылка на него присваивается параметру массива.   " );
        System.out.println( "-------------------------------------------------------------------------------------");

        System.out.println("Вопрос задачи 9; Будет Lyapis Trubetskoy " +
                "потому, что в  методе changePerson создается новый объект типа Person с значениями Ilya и Lagutenko и присваивается параметру person. Но это изменение не влияет на начальный объект," +
                " на который ссылается переменная person в методе main. ");
        System.out.println("Вопрос задачи 10;Будет Ilya Lagutenko ,потому,что в методе changePerson присваиваются новые значения для полей name и surname объекта person. Так как переменная person в методе main и ссылка person в методе changePerson указывают на один и тот же объект" +
                " типа Person, изменения полей внутри метода changePerson также отражаются на объекте в методе main. ");
        System.out.println( "Анализ 9-10; В обеих задачах происходит изменение полей объекта типа Person внутри метода. В задаче 9, создается новый объект и присваивается копия ссылки на него, а в задаче 10, изменяются значения полей объекта, без создания нового объекта." +
                "Отличие заключается в способе изменения полей: в задаче 9 создается новый объект, а в задаче 10 изменяются значения полей существующего объекта. ");


    }


    }
